# RetryTimes Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentReloadLatestProgressChangedEventArgs..::..RetryTimes Property
DocumentReloadLatestProgressChangedEventArgs Class See Also
---
The number of times Revit has tried to Reload Latest. Its value is '0' at the first time.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public int RetryTimes { get; }
```

Visual Basic
---
```text
Public ReadOnly Property RetryTimes As Integer
	Get
```

Visual C++
---
```text
public:
property int RetryTimes {
	int get ();
}
```

# See Also
DocumentReloadLatestProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace